# data selection and indexing

In [56]:
import pandas as pd

In [57]:


df = pd.DataFrame({
    "Name": ["Amit", "Neha", "Ravi", "Sneha"],
    "Age": [20, 21, 22, 23],
    "Salary": [30000, 35000, 40000, 45000],
    "Placed": ["Yes", "No", "Yes", "No"]
})

In [58]:
df

    Name  Age  Salary Placed
0   Amit   20   30000    Yes
1   Neha   21   35000     No
2   Ravi   22   40000    Yes
3  Sneha   23   45000     No

## 1. column selection

In [59]:
age_col=df["Age"]

In [60]:
age_col

0    20
1    21
2    22
3    23
Name: Age, dtype: int64

## Select MULTIPLE columns -- DataFrame

In [61]:
features=df[["Age","Salary"]]

In [62]:
features

   Age  Salary
0   20   30000
1   21   35000
2   22   40000
3   23   45000

## 2. row selection

In [63]:
row_0=df.iloc[0]

In [64]:
row_0

Name       Amit
Age          20
Salary    30000
Placed      Yes
Name: 0, dtype: object

In [65]:
row_1=df.iloc[1]

In [66]:
row_1

Name       Neha
Age          21
Salary    35000
Placed       No
Name: 1, dtype: object

## 3. loc[] — Label-based selection

In [67]:
placed_students=df.loc[df["Placed"] == "Yes"]

In [68]:
placed_students

   Name  Age  Salary Placed
0  Amit   20   30000    Yes
2  Ravi   22   40000    Yes

In [69]:
result = df.loc[df["Age"] > 21, ["Name", "Salary"]]

In [70]:
result

    Name  Salary
2   Ravi   40000
3  Sneha   45000

## 4️ iloc[] — Position-based selection

In [71]:
first_rows=df.iloc[0:2]

In [72]:
first_rows

   Name  Age  Salary Placed
0  Amit   20   30000    Yes
1  Neha   21   35000     No

## Select specific rows & columns by index

In [73]:
data=df.iloc[1:4,1:3]

In [74]:
data

   Age  Salary
1   21   35000
2   22   40000
3   23   45000

## 5. boolean indexing

In [75]:
high_salary = df[df["Salary"] > 35000]

In [76]:
high_salary

    Name  Age  Salary Placed
2   Ravi   22   40000    Yes
3  Sneha   23   45000     No

In [77]:
filtered = df[(df["Salary"] > 30000) & (df["Placed"] == "Yes")]

In [78]:
filtered

   Name  Age  Salary Placed
2  Ravi   22   40000    Yes

## 6. Conditional Selection

## Create condition-based column

In [79]:
df["High_Salary"] = df["Salary"] > 35000

In [80]:
df

    Name  Age  Salary Placed  High_Salary
0   Amit   20   30000    Yes        False
1   Neha   21   35000     No        False
2   Ravi   22   40000    Yes         True
3  Sneha   23   45000     No         True

## 7. Setting & Resetting Index

In [82]:
df_indexed = df.set_index("Name")

In [83]:
df_indexed

       Age  Salary Placed  High_Salary
Name
Amit    20   30000    Yes        False
Neha    21   35000     No        False
Ravi    22   40000    Yes         True
Sneha   23   45000     No         True

## reset index back

In [84]:
df_reset = df_indexed.reset_index()

In [85]:
df_reset

    Name  Age  Salary Placed  High_Salary
0   Amit   20   30000    Yes        False
1   Neha   21   35000     No        False
2   Ravi   22   40000    Yes         True
3  Sneha   23   45000     No         True